fio/log/f2fs_5th_random_read_log.txt
fio_test: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
fio-2.2.8
Starting 8 threads

fio_test: (groupid=0, jobs=1): err= 0: pid=4572: Sat Jan 21 07:35:15 2017
  read : io=819200MB, bw=80333KB/s, iops=20083, runt=10442307msec
    slat (usec): min=1, max=4841, avg= 2.70, stdev= 1.21
    clat (usec): min=294, max=43772, avg=6370.19, stdev=8218.09
     lat (usec): min=296, max=43774, avg=6372.95, stdev=8218.18
    clat percentiles (usec):
     |  1.00th=[ 1020],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1208],
     | 30.00th=[ 1400], 40.00th=[ 1656], 50.00th=[ 1992], 60.00th=[ 2480],
     | 70.00th=[ 3344], 80.00th=[19328], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[23936], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[25984]
    bw (KB  /s): min=49264, max=469256, per=12.50%, avg=80345.78, stdev=8484.47
    lat (usec) : 500=0.01%, 750=0.03%, 1000=0.10%
    lat (msec) : 2=49.89%, 4=23.18%, 10=4.02%, 20=4.39%, 50=18.38%
  cpu          : usr=3.59%, sys=6.77%, ctx=174025000, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4573: Sat Jan 21 07:35:15 2017
  read : io=819200MB, bw=80345KB/s, iops=20086, runt=10440735msec
    slat (usec): min=1, max=10866, avg= 2.71, stdev= 1.46
    clat (usec): min=155, max=43780, avg=6369.23, stdev=8216.87
     lat (usec): min=784, max=43782, avg=6371.99, stdev=8216.96
    clat percentiles (usec):
     |  1.00th=[ 1020],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1208],
     | 30.00th=[ 1400], 40.00th=[ 1656], 50.00th=[ 1992], 60.00th=[ 2480],
     | 70.00th=[ 3344], 80.00th=[19328], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[23936], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[26240]
    bw (KB  /s): min=44040, max=133808, per=12.51%, avg=80380.13, stdev=7739.93
    lat (usec) : 250=0.01%, 1000=0.08%
    lat (msec) : 2=49.94%, 4=23.18%, 10=4.03%, 20=4.40%, 50=18.37%
  cpu          : usr=3.61%, sys=6.73%, ctx=174176152, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4574: Sat Jan 21 07:35:15 2017
  read : io=819200MB, bw=80395KB/s, iops=20098, runt=10434187msec
    slat (usec): min=1, max=7430, avg= 2.71, stdev= 1.39
    clat (usec): min=189, max=43743, avg=6365.22, stdev=8215.79
     lat (usec): min=881, max=43746, avg=6367.99, stdev=8215.89
    clat percentiles (usec):
     |  1.00th=[ 1020],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1208],
     | 30.00th=[ 1400], 40.00th=[ 1656], 50.00th=[ 1992], 60.00th=[ 2448],
     | 70.00th=[ 3344], 80.00th=[19328], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[23936], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[25984]
    bw (KB  /s): min=45609, max=113024, per=12.52%, avg=80432.11, stdev=7639.57
    lat (usec) : 250=0.01%, 1000=0.08%
    lat (msec) : 2=49.96%, 4=23.19%, 10=4.02%, 20=4.39%, 50=18.36%
  cpu          : usr=3.60%, sys=6.75%, ctx=174128544, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4575: Sat Jan 21 07:35:15 2017
  read : io=819200MB, bw=80435KB/s, iops=20108, runt=10429034msec
    slat (usec): min=1, max=4254, avg= 2.72, stdev= 1.27
    clat (usec): min=521, max=43728, avg=6362.06, stdev=8214.25
     lat (usec): min=689, max=43730, avg=6364.84, stdev=8214.34
    clat percentiles (usec):
     |  1.00th=[ 1020],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1208],
     | 30.00th=[ 1400], 40.00th=[ 1656], 50.00th=[ 1992], 60.00th=[ 2448],
     | 70.00th=[ 3344], 80.00th=[19328], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[23936], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[25984]
    bw (KB  /s): min=50900, max=111880, per=12.52%, avg=80472.68, stdev=7804.83
    lat (usec) : 750=0.01%, 1000=0.08%
    lat (msec) : 2=49.98%, 4=23.19%, 10=4.01%, 20=4.37%, 50=18.36%
  cpu          : usr=3.64%, sys=6.77%, ctx=173960874, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4576: Sat Jan 21 07:35:15 2017
  read : io=819200MB, bw=80337KB/s, iops=20084, runt=10441771msec
    slat (usec): min=1, max=4311, avg= 2.72, stdev= 1.13
    clat (usec): min=717, max=42798, avg=6369.84, stdev=8216.76
     lat (usec): min=894, max=42801, avg=6372.62, stdev=8216.85
    clat percentiles (usec):
     |  1.00th=[ 1020],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1208],
     | 30.00th=[ 1400], 40.00th=[ 1656], 50.00th=[ 2008], 60.00th=[ 2480],
     | 70.00th=[ 3344], 80.00th=[19328], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[23936], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[25984]
    bw (KB  /s): min=50808, max=298928, per=12.50%, avg=80363.64, stdev=7998.88
    lat (usec) : 750=0.01%, 1000=0.08%
    lat (msec) : 2=49.90%, 4=23.22%, 10=4.03%, 20=4.39%, 50=18.38%
  cpu          : usr=3.61%, sys=6.74%, ctx=174062566, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4577: Sat Jan 21 07:35:15 2017
  read : io=819200MB, bw=80345KB/s, iops=20086, runt=10440676msec
    slat (usec): min=1, max=4911, avg= 2.71, stdev= 1.25
    clat (usec): min=778, max=43349, avg=6369.17, stdev=8216.14
     lat (usec): min=782, max=43351, avg=6371.94, stdev=8216.24
    clat percentiles (usec):
     |  1.00th=[ 1020],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1208],
     | 30.00th=[ 1400], 40.00th=[ 1656], 50.00th=[ 2008], 60.00th=[ 2480],
     | 70.00th=[ 3344], 80.00th=[19328], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[23936], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[25984]
    bw (KB  /s): min=50213, max=147760, per=12.51%, avg=80381.10, stdev=7745.05
    lat (usec) : 1000=0.08%
    lat (msec) : 2=49.89%, 4=23.24%, 10=4.03%, 20=4.39%, 50=18.37%
  cpu          : usr=3.62%, sys=6.75%, ctx=174070195, majf=0, minf=130
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4578: Sat Jan 21 07:35:15 2017
  read : io=819200MB, bw=80345KB/s, iops=20086, runt=10440787msec
    slat (usec): min=1, max=5942, avg= 2.71, stdev= 1.25
    clat (usec): min=893, max=43704, avg=6369.25, stdev=8218.08
     lat (usec): min=896, max=43711, avg=6372.01, stdev=8218.17
    clat percentiles (usec):
     |  1.00th=[ 1020],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1208],
     | 30.00th=[ 1400], 40.00th=[ 1656], 50.00th=[ 1992], 60.00th=[ 2480],
     | 70.00th=[ 3344], 80.00th=[19328], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[23936], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[25984]
    bw (KB  /s): min=49365, max=143072, per=12.51%, avg=80379.85, stdev=7800.08
    lat (usec) : 1000=0.08%
    lat (msec) : 2=49.96%, 4=23.16%, 10=4.03%, 20=4.38%, 50=18.39%
  cpu          : usr=3.60%, sys=6.73%, ctx=174151915, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=4579: Sat Jan 21 07:35:15 2017
  read : io=819200MB, bw=80383KB/s, iops=20095, runt=10435862msec
    slat (usec): min=1, max=4539, avg= 2.72, stdev= 1.25
    clat (usec): min=920, max=42868, avg=6366.23, stdev=8216.71
     lat (usec): min=923, max=42871, avg=6369.01, stdev=8216.80
    clat percentiles (usec):
     |  1.00th=[ 1020],  5.00th=[ 1064], 10.00th=[ 1096], 20.00th=[ 1208],
     | 30.00th=[ 1400], 40.00th=[ 1656], 50.00th=[ 1992], 60.00th=[ 2448],
     | 70.00th=[ 3344], 80.00th=[19328], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[23936], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[26240]
    bw (KB  /s): min=44704, max=116136, per=12.51%, avg=80419.15, stdev=7715.76
    lat (usec) : 1000=0.08%
    lat (msec) : 2=50.02%, 4=23.13%, 10=4.01%, 20=4.40%, 50=18.37%
  cpu          : usr=3.62%, sys=6.76%, ctx=174029716, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: io=6400.0GB, aggrb=642663KB/s, minb=80332KB/s, maxb=80435KB/s, mint=10429034msec, maxt=10442307msec

Disk stats (read/write):
  nvme0n1: ios=1677678958/146, merge=0/0, ticks=2087808953/1706, in_queue=2126663285, util=100.00%