fio/log/f2fs_6th_sequential_read_log.txt
fio_test: (g=0): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.8
Starting 1 thread

fio_test: (groupid=0, jobs=1): err= 0: pid=5075: Sat Jan 21 07:43:55 2017
  read : io=819200MB, bw=1576.6MB/s, iops=12612, runt=519621msec
    slat (usec): min=3, max=238, avg= 4.53, stdev= 1.00
    clat (msec): min=1, max=29, avg=10.14, stdev= 1.85
     lat (msec): min=1, max=29, avg=10.15, stdev= 1.85
    clat percentiles (usec):
     |  1.00th=[ 2064],  5.00th=[ 9664], 10.00th=[ 9792], 20.00th=[ 9920],
     | 30.00th=[ 9920], 40.00th=[10048], 50.00th=[10176], 60.00th=[10176],
     | 70.00th=[10304], 80.00th=[10432], 90.00th=[10560], 95.00th=[10944],
     | 99.00th=[16768], 99.50th=[19840], 99.90th=[24192], 99.95th=[25472],
     | 99.99th=[26752]
    bw (MB  /s): min= 1503, max= 1622, per=100.00%, avg=1576.68, stdev=27.17
    lat (msec) : 2=0.91%, 4=1.48%, 10=31.05%, 20=66.10%, 50=0.46%
  cpu          : usr=2.22%, sys=6.50%, ctx=6407251, majf=0, minf=520
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=6553600/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: io=819200MB, aggrb=1576.6MB/s, minb=1576.6MB/s, maxb=1576.6MB/s, mint=519621msec, maxt=519621msec

Disk stats (read/write):
  nvme0n1: ios=6551441/0, merge=0/0, ticks=66431948/0, in_queue=66433295, util=100.00%